{"data":{"site":{"siteMetadata":{"author":"Cindy Zhang"}},"markdownRemark":{"id":"71ebd766-901e-50de-89a7-7af0c1272de2","excerpt":"I’m getting married this year and decided that instead of dealing\nwith paper RSVPs, I want to do them digitally. These days there are plenty of great free…","html":"<p>I’m getting married this year and decided that instead of dealing\nwith paper RSVPs, I want to do them digitally.</p>\n<p>These days there are plenty of great free options for creating a\nwedding site with RSVPs quickly and easily. You can create one with theKnot and\nI believe Zola has this feature as well. The unfortunate part is that you need\nto set up your RSVPs on their site. I just wanted an RSVP form that I could embed\nonto my own site and connects with the Google Sheet I’m using to keep track\nof all the invites.</p>\n<p>Originally, I planned to link to a Google Form for the guest\nto RSVP before deciding to embed a form on the page with a workflow.</p>\n<p>The problem with my original plan was that the Google Form doesn’t have\na way to validate or gate who can submit the form by whether they’re in\nthe guest list. However, there’s a way to do this by using Google’s App Scripts,\nwhich makes it possible to have this functionality with all the benefits of\na form that’s tied to your event spreadsheet. I managed to accomplish\nthis by writing 2 App Scripts.</p>\n<p>Here’s how it works:</p>\n<ol>\n<li>The User is prompted to enter their name.</li>\n<li>The page sends a request to a script that checks the name against the guest list. (App Script #1)</li>\n<li>If we’re able to find the user, prompt the rest of the form questions.</li>\n<li>Once the user submits, make a request to a second script that records the information. (App Script #2)</li>\n</ol>\n<p><a href=\"https://script.google.com/d/1koKbzUqZyLHREU2J36KJsmy6mlg3VIY7d1ezZyyBYzMPCyB5N5N1Ibh8\">App Script #1</a></p>\n<p>This script was created within the wedding spreadsheet. I’ve got a sheet that’s named “RSVP”\nwhich contained a list of everyone we wanted to invite to the wedding. The script loads\nthe list of names and returns all matches it can find.</p>\n<p><a href=\"https://script.google.com/d/1d5r0QPaxoDiBUt9RljSs7gdKAV0-BTaXf_3k-SVALGZl99i8h-2t0Ywr\">App Script #2</a></p>\n<p>Another script that’s linkked to the wedding spreadsheet. It takes in the response and updates the sheet.</p>","frontmatter":{"title":"Guest Lists and RSVPs With Google Sheets","date":"January 13, 2019"}}},"pageContext":{"slug":"/wedding-rsvp-using-google-forms/wip/","previous":null,"next":null}}