{"data":{"site":{"siteMetadata":{"author":"Cindy Zhang"}},"markdownRemark":{"id":"b8972c5f-0738-5ab3-8498-833c13009cfb","excerpt":"I’m getting married this year and one of the many tasks\ninvolved include creating a wedding website with an RSVP form. We wanted a place where guests can find…","html":"<p>I’m getting married this year and one of the many tasks\ninvolved include creating a wedding website with an RSVP form.</p>\n<ul>\n<li>We wanted a place where guests can find up to date information\nabout the event</li>\n<li>We’re not sending paper invites or, so the website doubles as the\n“face” of the invite and handles RSVPs</li>\n<li>I procrastinated planning until January and the wedding is in March >_&#x3C;</li>\n</ul>\n<p>These days there are plenty of great free options for creating a\nwedding site with RSVPs quickly and easily. You can create one with theKnot and\nI believe Zola has this feature as well. Of course, I decided to\nchoose the hard way: write my own single page wedding info with an RSVP form.</p>\n<p>Originally, I planned to link to a Google Form for the guest\nto RSVP before deciding to embed a form on the page with a workflow.</p>\n<p>The problem with my original plan was that the Google Form doesn’t have\na way to validate or gate who can submit the form by whether they’re in\nthe guest list. However, there’s a way to do this by using Google’s App Scripts,\nwhich makes it possible to have this functionality with all the benefits of\na form that’s tied to your event spreadsheet. I managed to accomplish\nthis by writing 2 App Scripts.</p>\n<p>Here’s how it works:</p>\n<ol>\n<li>The User is prompted to enter their name.</li>\n<li>The page sends a request to a script that checks the name against the guest list. (App Script #1)</li>\n<li>If we’re able to find the user, prompt the rest of the form questions.</li>\n<li>Once the user submits, make a request to a second script that records the information. (App Script #2)</li>\n</ol>","frontmatter":{"title":"RSVPs With Google Forms","date":"Invalid date"}}},"pageContext":{"slug":"/wedding-rsvp-using-google-forms/","previous":{"fields":{"slug":"/hello-world/"},"frontmatter":{"title":"Hello World"}},"next":null}}